hiperiondev/esp32idf_APRS/components/esp32_IDF_libAPRS/AFSK.c
// float m_osc_delta, s_osc_delta;
// static inline void push_sample(float val, float *buff, int size)
// {
//   // memccpy(buff + 1, buff, (size - 1) * sizeof(float));
//   memmove(buff + 1, buff, (size - 1));
//   buff[0] = val;
// }
// /* FIR filter kernel. */

// static inline float convolve(const float *data, const float *filter, int filter_taps)
// {
//   float sum = 0.0f;
//   int j;

//   // #pragma GCC ivdep				// ignored until gcc 4.9
//   for (j = 0; j < filter_taps; j++)
//   {
//     sum += filter[j] * data[j];
//   }
//   return (sum);
// }
// #endif

void LED_Status2(uint8_t r, uint8_t g, uint8_t b) {
    // portENTER_CRITICAL_ISR(&ledMux);          // ISR start
    if (r == r_old && g == g_old && b == b_old) {
        rgbTimeout = millis() + 100;
    } else {
        if (millis() > rgbTimeout) {
            rgbTimeout = millis() + 100;
            r_old = r;
            g_old = g;
            b_old = b;
            if (_led_strip_pin > -1) {
                //ws2812_set_pixel(_led_strip_pin, r, g, b);
            } else {
                if (_led_tx_pin > -1) {
                    if (r > 0)
                        digitalWrite(_led_tx_pin, HIGH);
                    else
                        digitalWrite(_led_tx_pin, LOW);
                }
                if (_led_rx_pin > -1) {
                    if (g > 0)
                        digitalWrite(_led_rx_pin, HIGH);
                    else
                        digitalWrite(_led_rx_pin, LOW);
                }
            }
        }
    }
    // portEXIT_CRITICAL_ISR(&ledMux);
}

// const float resample_coeffs[FILTER_TAPS] = {
//   -0.001296,  -0.005406,  -0.012387,  -0.010745,  0.020421,  0.090370,  0.178421,  0.240624,  0.240624,  0.178421,  0.090370,  0.020421,  -0.010745,
//   -0.012387,  -0.005406,  -0.001296
// };
// Filter coefficients (designed for 38400→9600 resampling)
// cutoff = 4800  # Nyquist for 9600Hz
const float resample_coeffs[FILTER_TAPS] = { 0.003560, 0.038084, 0.161032, 0.297324, 0.297324, 0.161032, 0.038084, 0.003560 };
// Filter instance and buffers
fir_f32_t resample_fir;
// float input_buffer[BLOCK_SIZE] = {0};
// float output_buffer[BLOCK_SIZE / RESAMPLE_RATIO] = {0};
// float filter_state[FILTER_TAPS + BLOCK_SIZE - 1] = {0};
void resample_audio(float *input_buffer) {
    // Apply anti-aliasing filter and decimate
    for (int i = 0; i < BLOCK_SIZE / RESAMPLE_RATIO; i++) {
        float sum = 0;
        for (int j = 0; j < FILTER_TAPS; j++) {
            int index = i * RESAMPLE_RATIO + j;
            if (index < BLOCK_SIZE) {
                sum += input_buffer[index] * resample_coeffs[j];
            }
        }
        input_buffer[i] = sum;
    }
}

// AGC state
float agc_gain = 1.0f;

tcb_t tcb;

// Audio processing
volatile bool new_samples = false;

float update_agc(float *input_buffer, size_t len) {
    // Calculate RMS of current block
    float sum_sq = 0;
    for (int i = 0; i < len; i++) {
        sum_sq += input_buffer[i] * input_buffer[i];
    }
    float rms = sqrtf(sum_sq / len);

    // Adjust gain based on RMS level
    float error = AGC_TARGET_RMS / (rms + 1e-6f);
    float rate = (error < 1.0f) ? AGC_RELEASE : AGC_ATTACK;
    agc_gain = agc_gain * (1.0f - rate) + (agc_gain * error) * rate;
    agc_gain = fmaxf(fminf(agc_gain, AGC_MAX_GAIN), AGC_MIN_GAIN);
    return agc_gain;
}

#define AX25_FLAG      0x7e
#define AX25_MASK      0xfc // bit mask of MSb six bits
#define AX25_EOP       0xfc // end of packet, 7e << 1
#define AX25_STUFF_BIT 0x7c // bit stuffing bit, five of continuous one bits
// #define AX25_MIN_PKT_SIZE (7 * 2 + 1 + 1 + 2) // call sign * 2 + control + PID + FCS
#define AX25_FLAG_BITS 6

#define AX25_ADDR_LEN     7
#define AX25_MIN_PKT_SIZE (AX25_ADDR_LEN * 2 + 1 + 2) // src addr + dst addr + Control + FCS
#define AX25_SSID_MASK    0x0f

// static int ax25_check_fcs(uint8_t data[], int len)
// {
//   // uint16_t fcs, crc;

//   if (len < AX25_MIN_PKT_SIZE)
//     return false;

// #if 0
//     fcs = data[len - 1] << 8 | data[len - 2];
//     crc = crc16_le(0, data, len - 2);

//     static int count = 0;
//     if (fcs == crc && ++count > 10) {
// 	ESP_LOGI(TAG, "GOOD_CRC = %04x", crc16_le(0, data, len));
// 	count = 0;
//     }

//     return fcs == crc;
// #else

// #define GOOD_CRC 0x0f47

//   return crc16_le(0, data, len) == GOOD_CRC;
// #endif
// }

// enum STATE
// {
//   FLAG = 0,
//   DATA
// };

extern AX25Ctx AX25;

#ifdef CONFIG_IDF_TARGET_ESP32
// #define I2S_INTERNAL 1
// #include "driver/i2s.h"
uint8_t adc_pins[] = { 36, 39, 34, 35 }; // some of ADC1 pins for ESP32
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
uint8_t adc_pins[] = { 1, 2, 3, 4 }; // ADC1 common pins for ESP32S3
#else
uint8_t adc_pins[] = { 0, 2, 3, 4 }; // ADC1 common pins for ESP32S2/S3 + ESP32C3/C6 + ESP32H2
#endif

// adc_continuous_handle_t adc_handle[SOC_ADC_PERIPH_NUM];
// extern adc_handle_t adc_handle[SOC_ADC_PERIPH_NUM];
adc_continuous_handle_t AdcHandle = NULL;
adc_cali_handle_t AdcCaliHandle = NULL;

// Calculate how many pins are declared in the array - needed as input for the setup function of ADC Continuous
uint8_t adc_pins_count = sizeof(adc_pins) / sizeof(uint8_t);

// Flag which will be set in ISR when conversion is done
volatile bool adc_coversion_done = false;

// Result structure for ADC Continuous reading
adc_continuous_data_t *result = NULL;

// adc_atten_t cfg_adc_atten = ADC_ATTEN_DB_0;
#ifdef ADC_SAMPLE
adc_atten_t cfg_adc_atten = ADC_ATTEN_DB_0;
void afskSetADCAtten(uint8_t val) {
    adc_atten = val;
    if (adc_atten == 0) {
        cfg_adc_atten = ADC_ATTEN_DB_0;
        Vref = 950;
    } else if (adc_atten == 1) {
        cfg_adc_atten = ADC_ATTEN_DB_2_5;
        Vref = 1250;
    } else if (adc_atten == 2) {
        cfg_adc_atten = ADC_ATTEN_DB_6;
        Vref = 1750;
    } else if (adc_atten == 3) {
        cfg_adc_atten = ADC_ATTEN_DB_12;
        Vref = 2450;
    } else if (adc_atten == 4) {
        cfg_adc_atten = ADC_ATTEN_DB_12;
        Vref = 3300;
    }
    analogSetPinAttenuation(adc_pins[0], cfg_adc_atten);
}
#else
adc_atten_t cfg_adc_atten = ADC_ATTEN_DB_0;
void afskSetADCAtten(uint8_t val) {
    adc_atten = val;
    if (adc_atten == 0) {
        cfg_adc_atten = ADC_ATTEN_DB_0;
        Vref = 950;
    } else if (adc_atten == 1) {
        cfg_adc_atten = ADC_ATTEN_DB_2_5;
        Vref = 1250;
    } else if (adc_atten == 2) {
        cfg_adc_atten = ADC_ATTEN_DB_6;
        Vref = 1750;
    } else if (adc_atten == 3) {
        cfg_adc_atten = ADC_ATTEN_DB_12;
        Vref = 2450;
    } else if (adc_atten == 4) {
        cfg_adc_atten = ADC_ATTEN_DB_12;
        Vref = 3300;
    }
}
#endif

uint8_t CountOnesFromInteger(uint8_t value) {
    uint8_t count;
    for (count = 0; value != 0; count++, value &= value - 1)
        ;
    return count;
}

