hiperiondev/esp32idf_APRS/components/esp32_IDF_libAPRS/AFSK.c
uint16_t CountOnesFromInteger16(uint16_t value) {
    uint16_t count = 0;
    for (int i = 0; i < 16; i++) {
        if (value & 0x0001)
            count++;
        value >>= 1;
    }
    return count;
}

#define IMPLEMENTATION    FIFO
#define ADC_SAMPLES_COUNT (BLOCK_SIZE / 2)

// #if defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C6)
// cppQueue adcq(sizeof(int16_t), 768, IMPLEMENTATION, true); // Instantiate queue
// #else
// cppQueue adcq(sizeof(int16_t), 768 * 2, IMPLEMENTATION, true); // Instantiate queue
// #endif

volatile int8_t adcEn = 0;
volatile int8_t dacEn = 0;
volatile bool pttOff = false;

#ifdef I2S_INTERNAL
#define ADC_PATT_LEN_MAX     (16)
#define ADC_CHECK_UNIT(unit) RTC_MODULE_CHECK(adc_unit < ADC_UNIT_2, "ADC unit error, only support ADC1 for now", ESP_ERR_INVALID_ARG)
#define RTC_MODULE_CHECK(a, str, ret_val)                                                                                                                      \
    if (!(a)) {                                                                                                                                                \
        ESP_LOGD(TAG_AFSK, "%s:%d (%s):%s", __FILE__, __LINE__, __FUNCTION__, str);                                                                            \
        return (ret_val);                                                                                                                                      \
    }

i2s_event_t i2s_evt;
static QueueHandle_t i2s_event_queue;

static esp_err_t adc_set_i2s_data_len(adc_unit_t adc_unit, int patt_len) {
    ADC_CHECK_UNIT(adc_unit);
    RTC_MODULE_CHECK((patt_len < ADC_PATT_LEN_MAX) && (patt_len > 0), "ADC pattern length error", ESP_ERR_INVALID_ARG);
    // portENTER_CRITICAL(&rtc_spinlock);
    if (adc_unit & ADC_UNIT_1) {
        SYSCON.saradc_ctrl.sar1_patt_len = patt_len - 1;
    }
    if (adc_unit & ADC_UNIT_2) {
        SYSCON.saradc_ctrl.sar2_patt_len = patt_len - 1;
    }
    // portEXIT_CRITICAL(&rtc_spinlock);
    return ESP_OK;
}

static esp_err_t adc_set_i2s_data_pattern(adc_unit_t adc_unit, int seq_num, adc_channel_t channel, adc_bits_width_t bits, adc_atten_t atten) {
    ADC_CHECK_UNIT(adc_unit);
    if (adc_unit & ADC_UNIT_1) {
        RTC_MODULE_CHECK((adc1_channel_t)channel < ADC1_CHANNEL_MAX, "ADC1 channel error", ESP_ERR_INVALID_ARG);
    }
    RTC_MODULE_CHECK(bits < ADC_WIDTH_MAX, "ADC bit width error", ESP_ERR_INVALID_ARG);
    RTC_MODULE_CHECK(atten <= ADC_ATTEN_DB_12, "ADC Atten Err", ESP_ERR_INVALID_ARG);

    // portENTER_CRITICAL(&rtc_spinlock);
    // Configure pattern table, each 8 bit defines one channel
    //[7:4]-channel [3:2]-bit width [1:0]- attenuation
    // BIT WIDTH: 3: 12BIT  2: 11BIT  1: 10BIT  0: 9BIT
    // ATTEN: 3: ATTEN = 11dB 2: 6dB 1: 2.5dB 0: 0dB
    uint8_t val = (channel << 4) | (bits << 2) | (atten << 0);
    if (adc_unit & ADC_UNIT_1) {
        SYSCON.saradc_sar1_patt_tab[seq_num / 4] &= (~(0xff << ((3 - (seq_num % 4)) * 8)));
        SYSCON.saradc_sar1_patt_tab[seq_num / 4] |= (val << ((3 - (seq_num % 4)) * 8));
    }
    if (adc_unit & ADC_UNIT_2) {
        SYSCON.saradc_sar2_patt_tab[seq_num / 4] &= (~(0xff << ((3 - (seq_num % 4)) * 8)));
        SYSCON.saradc_sar2_patt_tab[seq_num / 4] |= (val << ((3 - (seq_num % 4)) * 8));
    }
    // portEXIT_CRITICAL(&rtc_spinlock);
    return ESP_OK;
}

void I2S_Init(i2s_mode_t MODE, i2s_bits_per_sample_t BPS) {
    i2s_config_t i2s_config = {
        //.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_TX | I2S_MODE_DAC_BUILT_IN | I2S_MODE_ADC_BUILT_IN),
        .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_ADC_BUILT_IN),
        .sample_rate = SAMPLERATE,
        .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
        .channel_format = I2S_CHANNEL_FMT_ALL_LEFT,
        .communication_format = (i2s_comm_format_t)I2S_COMM_FORMAT_I2S_MSB,
        .intr_alloc_flags = 0, // ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count = 5,
        .dma_buf_len = 768 * 2,
        //.tx_desc_auto_clear   = true,
        .use_apll = false // no Audio PLL ( I dont need the adc to be accurate )
    };

    // if (MODE == I2S_MODE_RX || MODE == I2S_MODE_TX)
    // {
    //   ESP_LOGD(TAG_AFSK, "using I2S_MODE");
    //   i2s_pin_config_t pin_config;
    //   pin_config.bck_io_num = PIN_I2S_BCLK;
    //   pin_config.ws_io_num = PIN_I2S_LRC;
    //   if (MODE == I2S_MODE_RX)
    //   {
    //     pin_config.data_out_num = I2S_PIN_NO_CHANGE;
    //     pin_config.data_in_num = PIN_I2S_DIN;
    //   }
    //   else if (MODE == I2S_MODE_TX)
    //   {
    //     pin_config.data_out_num = PIN_I2S_DOUT;
    //     pin_config.data_in_num = I2S_PIN_NO_CHANGE;
    //   }

    //   i2s_driver_install(I2S_NUM_0, &i2s_config, 0, NULL);
    //   i2s_set_pin(I2S_NUM_0, &pin_config);
    //   i2s_set_clk(I2S_NUM_0, SAMPLE_RATE, BPS, I2S_CHANNEL_MONO);
    // }
    // else if (MODE == I2S_MODE_DAC_BUILT_IN || MODE == I2S_MODE_ADC_BUILT_IN)
    // {
    ESP_LOGD(TAG_AFSK, "Using I2S DAC/ADC_builtin");
    // install and start i2s driver
    if (i2s_driver_install(I2S_NUM_0, &i2s_config, 5, &i2s_event_queue) != ESP_OK) {
        ESP_LOGD(TAG_AFSK, "ERROR: Unable to install I2S drives");
    }
    // GPIO36, VP
    // init ADC pad
    i2s_set_adc_mode(ADC_UNIT_1, ADC1_CHANNEL_0);
    // i2s_set_clk(I2S_NUM_0, SAMPLE_RATE, BPS, I2S_CHANNEL_MONO);
    i2s_adc_enable(I2S_NUM_0);
    delay(500); // required for stability of ADC

    // ***IMPORTANT*** enable continuous adc sampling
    SYSCON.saradc_ctrl2.meas_num_limit = 0;
    // sample time SAR setting
    SYSCON.saradc_ctrl.sar_clk_div = 2;
    SYSCON.saradc_fsm.sample_cycle = 2;
    adc_set_i2s_data_pattern(ADC_UNIT_1, 0, ADC_CHANNEL_0, ADC_WIDTH_BIT_12, cfg_adc_atten); // Input Vref 1.36V=4095,Offset 0.6324V=1744
    adc_set_i2s_data_len(ADC_UNIT_1, 1);

    i2s_set_pin(I2S_NUM_0, NULL);
    i2s_set_dac_mode(I2S_DAC_CHANNEL_LEFT_EN); // IO26
    i2s_zero_dma_buffer(I2S_NUM_0);
    // i2s_start(I2S_NUM_0);
    //  dac_output_enable(DAC_CHANNEL_1);
    // dac_output_enable(DAC_CHANNEL_2);
    // dac_i2s_enable();
    //}
}

void AFSK_TimerEnable(bool sts) {
    if (sts == true) {
        i2s_adc_enable(I2S_NUM_0);
        adcEn = 0;
    } else {
        i2s_adc_disable(I2S_NUM_0);
        adcEn = 0;
    }
}

#else

portMUX_TYPE timerMux = portMUX_INITIALIZER_UNLOCKED;

