hiperiondev/esp32idf_APRS/components/esp32_IDF_libAPRS/AFSK.c
// static bool check_valid_data(const adc_digi_output_data_t *data);

// #define GET_UNIT(x) ((x >> 3) & 0x1)
// static uint16_t adc1_chan_mask = BIT(0);
// static uint16_t adc2_chan_mask = 0;
// static adc_channel_t channel[1] = {(adc_channel_t)ADC_CHANNEL_0};
#ifndef ADC_SAMPLE
static const char *TAG = "--(TAG ADC DMA)--";
#endif
#if defined(ADC_SAMPLE)
#define ADC_OUTPUT_TYPE ADC_DIGI_OUTPUT_FORMAT_TYPE1
void IRAM_ATTR sample_adc_isr() {
    adcIsrCount++;
    if (!hw_afsk_dac_isr) {
        fifo.lock = true;
        // digitalWrite(15,HIGH);
        portENTER_CRITICAL_ISR(&timerMux); // ISR start
        int16_t adc = analogReadMilliVolts(adc_pins[0]);

        // RingBuffer_Push(&fifo, adc);
        // if(fifo.head >= BUFFER_SIZE || fifo.head < 0) fifo.head = 0; // Check if head exceeds buffer size
        fifo.buffer[fifo.head] = adc;
        fifo.head = (fifo.head + 1) % BUFFER_SIZE; // Wrap around using modulo
        fifo.count++;
        portEXIT_CRITICAL_ISR(&timerMux); // ISR end
        // digitalWrite(15,LOW);
        fifo.lock = false;
    }
}
#else
#define ADC_OUTPUT_TYPE ADC_DIGI_OUTPUT_FORMAT_TYPE2
#endif

// Forward declerations
// int afsk_getchar(void);

// hw_timer_t *timer = NULL;

bool adcStopFlag = false;
void AFSK_TimerEnable(bool sts) {
    // if (xSemaphoreTake(xI2CSemaphore, (TickType_t)DEFAULT_SEMAPHORE_TIMEOUT) == pdTRUE)
    // {
    // vTaskSuspendAll ();
    // adcq.flush();
    // Note: fifo is initialized in AFSK_hw_init, not here
    portENTER_CRITICAL_ISR(&timerMux); // ISR start
    if (sts == true) {

#ifdef ADC_SAMPLE
        RingBuffer_IsEmpty(&fifo);
        timerStart(timer_adc);
#else
        //   timerAlarmEnable(timer);
        if (AdcHandle != NULL) {

            // adc_continuous_start(AdcHandle);
            //  HAL_FORCE_MODIFY_U32_REG_FIELD(SYSCON.saradc_ctrl2, meas_num_limit, 1);
        }
#endif
        adcEn = 0;
    } else {
#ifdef ADC_SAMPLE
        timerStop(timer_adc);
#else
        //   timerAlarmDisable(timer);
        if (AdcHandle != NULL) {
            // while(fifo.lock); // wait if locked
            //  ESP_LOGD(TAG_AFSK, "SAR DIV=%d LEN=%d", SYSCON.saradc_ctrl.sar_clk_div, SYSCON.saradc_ctrl.sar1_patt_len);
            //  HAL_FORCE_MODIFY_U32_REG_FIELD(SYSCON.saradc_ctrl2, meas_num_limit, 0);
            //  SYSCON.saradc_ctrl.sar1_patt_p_clear = 1;
            // adc_continuous_flush_pool(AdcHandle);
            // adc_continuous_stop(AdcHandle);
            //  adcStopFlag = true;
        }
#endif
        adcEn = 0;
    }
    portEXIT_CRITICAL_ISR(&timerMux); // ISR end
                                      // xTaskResumeAll ();
                                      // }
}
#endif

SemaphoreHandle_t xI2CSemaphore;

#define DEFAULT_SEMAPHORE_TIMEOUT 10

void DAC_TimerEnable(bool sts) {
    if (timer_dac == NULL)
        return;
    portENTER_CRITICAL_ISR(&timerMux);
    if (sts == true) {
        timerStart(timer_dac);
    } else {
        timerStop(timer_dac);
    }
    portEXIT_CRITICAL_ISR(&timerMux);
    dacEn = 0;
}

bool getTransmit() {
    bool ret = false;
    if ((digitalRead(_ptt_pin) ^ _ptt_active) == 0) // signal active with ptt_active
        ret = true;
    else
        ret = false;
    if (hw_afsk_dac_isr)
        ret = true;
    return ret;
}

void setTransmit(bool val) {
    hw_afsk_dac_isr = val;
}

bool getReceive() {
    bool ret = true;
    if ((digitalRead(_ptt_pin) ^ _ptt_active) == 0) // signal active with ptt_active
        return false;                               // PTT Protection receive
    // if (digitalRead(LED_RX_PIN))                    // Check RX LED receiving.
    //   ret = true;
    return ret;
}

/**
 * @brief Controls PTT output
 * @param state False - PTT off, true - PTT on
 */
void setPtt(bool state) {
    ESP_LOGD(TAG_AFSK, "PTT Pin: %d, Active: %d, State: %d", _ptt_pin, _ptt_active, state);
    if (state) {
        setTransmit(true);
#if defined(CONFIG_IDF_TARGET_ESP32S3)
        if ((_ptt_pin > 25) && (_ptt_pin < 38))
            _ptt_pin = 5; // GPIO25-37 are flash only on ESP32S3
#else
        if (_ptt_pin > 34)
            _ptt_pin = 32; // GPIO34 is the max pin for ESP32/ESP32S2
#endif
        if (_ptt_active) {
            pinMode(_ptt_pin, OUTPUT);
            digitalWrite(_ptt_pin, HIGH);
        } else { // Open Collector to LOW
            pinMode(_ptt_pin, OUTPUT_OPEN_DRAIN);
            digitalWrite(_ptt_pin, LOW);
        }
        LED_Status2(255, 0, 0);
    } else {
        setTransmit(false);
        // adcq.flush();
        if (_ptt_active) {
            pinMode(_ptt_pin, OUTPUT);
            digitalWrite(_ptt_pin, LOW);
        } else { // Open Collector to HIGH
            pinMode(_ptt_pin, OUTPUT_OPEN_DRAIN);
            digitalWrite(_ptt_pin, HIGH);
        }
        LED_Status2(0, 0, 0);
    }
}

uint8_t modem_config = 0;
void afskSetModem(uint8_t val, bool bpf, uint16_t timeSlot, uint16_t preamble, uint8_t fx25Mode) {
    if (bpf)
        ModemConfig.flatAudioIn = 1;
    else
        ModemConfig.flatAudioIn = 0;

    if (val == 0) {
        ModemConfig.modem = MODEM_300;
#if defined(ADC_SAMPLE)
        SAMPLERATE = 9600;
        BLOCK_SIZE = (SAMPLERATE / 25);
#elif defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C6)
        SAMPLERATE = 9600;
        BLOCK_SIZE = (SAMPLERATE / 25);
#else
        SAMPLERATE = 19200;
        BLOCK_SIZE = (SAMPLERATE / 50);
#endif
        RESAMPLE_RATIO = (SAMPLERATE / 9600);
    } else if (val == 1) {
        ModemConfig.modem = MODEM_1200;
#if defined(ADC_SAMPLE)
        SAMPLERATE = 9600;
        BLOCK_SIZE = (SAMPLERATE / 25);
#elif defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C6)
        SAMPLERATE = 19200;
        BLOCK_SIZE = (SAMPLERATE / 50);
#else
        SAMPLERATE = 28800;
        BLOCK_SIZE = (SAMPLERATE / 50);
#endif
        RESAMPLE_RATIO = (SAMPLERATE / 9600);
    } else if (val == 2) {
        ModemConfig.modem = MODEM_1200_V23;
#if defined(ADC_SAMPLE)
        SAMPLERATE = 9600;
        BLOCK_SIZE = (SAMPLERATE / 25);
#elif defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C6)
        SAMPLERATE = 19200;
        BLOCK_SIZE = (SAMPLERATE / 50);
#else
        SAMPLERATE = 28800;
        BLOCK_SIZE = (SAMPLERATE / 50);
#endif
        BLOCK_SIZE = (SAMPLERATE / 50); // Must be multiple of resample ratio
        RESAMPLE_RATIO = (SAMPLERATE / 9600);
    } else if (val == 3) {
        ModemConfig.modem = MODEM_9600;
        SAMPLERATE = 38400;
        BLOCK_SIZE = (SAMPLERATE / 100); // Must be multiple of resample ratio
        RESAMPLE_RATIO = (SAMPLERATE / 38400);
    }
    if (audio_buffer != NULL) {
        free(audio_buffer);
        audio_buffer = NULL;
    }
    audio_buffer = (float *)calloc(BLOCK_SIZE, sizeof(float));
    if (audio_buffer == NULL) {
        ESP_LOGD(TAG_AFSK, "Error allocating memory for audio buffer");
        return;
    }
    ESP_LOGD(TAG_AFSK, "Modem: %d, SampleRate: %d, BlockSize: %d", ModemConfig.modem, SAMPLERATE, BLOCK_SIZE);
    ModemConfig.usePWM = 1;
    ModemInit();
    Ax25Init(fx25Mode);
#ifdef ENABLE_FX25
    if (fx25Mode > 0)
        Fx25Init();
#endif
    Ax25TimeSlot(timeSlot);
    Ax25TxDelay(preamble);
}

