hiperiondev/esp32idf_APRS/components/esp32_IDF_libAPRS/AFSK.c
// adc_continuous_start(AdcHandle);

// adc_cali_line_fitting_config_t cali_config = {
//     .unit_id = ADC_UNIT_1,
//     .atten = ADC_ATTEN_DB_0,
//     .bitwidth = ADC_BITWIDTH_12,
// };
// ESP_LOGD(TAG_AFSK, "Creating ADC_UNIT_%d line cali handle", 1);
// Err = adc_cali_create_scheme_line_fitting(&cali_config, &AdcCaliHandle);
// // Err = adc_cali_create_scheme_curve_fitting(&Curve_Fitting, &AdcCaliHandle);
// if (Err != ESP_OK)
//   ESP_LOGI(TAG, "=====> AdMeasure : Fail to create the Curve Fitting Scheme.");
// else
// {
//   /* On démarre l'ADC : */
//   //SYSCON.saradc_ctrl2.meas_num_limit = 0;
//   adc_continuous_start(AdcHandle);
//   //adc_continuous_stop(AdcHandle);
//   //SYSCON.saradc_ctrl2.meas_num_limit = 0;
//   //HAL_FORCE_MODIFY_U32_REG_FIELD(SYSCON.saradc_ctrl2, meas_num_limit, 0);
//   ESP_LOGD(TAG_AFSK, "ADC Continuous has been start");
// }
/* Mise en place de la calibration permettant d'avoir les résultats en mV directement :
 * On utilise le schéma de calibration de type Courbe (Le seul proposé par la puce). */
#ifdef CONFIG_IDF_TARGET_ESP32
            adc_cali_line_fitting_config_t cali_config = {
#else
            adc_cali_curve_fitting_config_t cali_config = {
#endif
                .unit_id = ADC_UNIT_1,
                .atten = cfg_adc_atten,
                .bitwidth = ADC_BITWIDTH_12,
            };

#ifdef CONFIG_IDF_TARGET_ESP32
            Err = adc_cali_create_scheme_line_fitting(&cali_config, &AdcCaliHandle);
            ESP_LOGD(TAG_AFSK, "Creating ADC_UNIT_%d line cali handle", 1);
//
#else
            Err = adc_cali_create_scheme_curve_fitting(&cali_config, &AdcCaliHandle);
            ESP_LOGD(TAG_AFSK, "Creating ADC_UNIT_%d cerve cali handle", 1);
//
#endif

            // s_task_handle = xTaskGetCurrentTaskHandle();

            if (Err != ESP_OK)
                ESP_LOGI(TAG, "=====> AdMeasure : Fail to create the Curve Fitting Scheme.");
            else {
                // if(_sql_pin < 0){
                /* On démarre l'ADC : */
                // SYSCON.saradc_ctrl2.meas_num_limit = 0;
                adc_continuous_start(AdcHandle);
                // adc_continuous_stop(AdcHandle);
                // SYSCON.saradc_ctrl2.meas_num_limit = 0;
                // HAL_FORCE_MODIFY_U32_REG_FIELD(SYSCON.saradc_ctrl2, meas_num_limit, 0);
                ESP_LOGD(TAG_AFSK, "ADC Continuous has been start");
                adcStopFlag = false;

                // }else{
                //   adc_continuous_stop(AdcHandle);
                //   adcStopFlag = true; // Stop ADC if SQL pin is set
                // }
            }
        }
    }
}
#endif
#endif // I2C

/*
 * Configure and initialize the sigma delta modulation
 * on channel 0 to output signal on GPIO4
 */
static sdm_channel_handle_t sdm_chan = NULL;

static void sigmadelta_init(void) {
    sdm_config_t sdm_cfg = {
        .clk_src = SDM_CLK_SRC_DEFAULT,
        .sample_rate_hz = 96 * 8 * 1000, // equivalent to old prescale=96 setting
#ifdef CONFIG_IDF_TARGET_ESP32C3
        .gpio_num = GPIO_NUM_1, // GPIO1 is used for ESP32C3
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
        .gpio_num = GPIO_NUM_2, // GPIO2 is used for ESP32S3
#else
        .gpio_num = GPIO_NUM_26,
#endif
    };
    ESP_ERROR_CHECK(sdm_new_channel(&sdm_cfg, &sdm_chan));
    ESP_ERROR_CHECK(sdm_channel_set_pulse_density(sdm_chan, 0));
    ESP_ERROR_CHECK(sdm_channel_enable(sdm_chan));
}

void AFSK_hw_init(void) {
    // Set up ADC
    if (_sql_pin > -1)
        pinMode(_sql_pin, INPUT_PULLUP);
    if (_pwr_pin > -1)
        pinMode(_pwr_pin, OUTPUT);
    if (_led_tx_pin > -1) {
        pinMode(_led_tx_pin, OUTPUT);
    }
    if (_led_rx_pin > -1) {
        pinMode(_led_rx_pin, OUTPUT);
    }
    if (_led_strip_pin > -1) {
        //ws2812_init(_led_strip_pin);
    }

    if (_pwr_pin > -1)
        digitalWrite(_pwr_pin, !_pwr_active);

    RingBuffer_Init(&fifo); // Initialize the ring buffer

#ifdef I2S_INTERNAL
    //  Initialize the I2S peripheral
    I2S_Init(I2S_MODE_DAC_BUILT_IN, I2S_BITS_PER_SAMPLE_16BIT);
#else

#ifdef ADC_SAMPLE
    pinMode(15, OUTPUT);
    analogReadResolution(12);
    analogSetPinAttenuation(adc_pins[0], cfg_adc_atten);
    timer_adc = timerBegin(20000000);
    // Attach onTimer function to our timer.
    timerAttachInterrupt(timer_adc, &sample_adc_isr); // Attaches the handler function to the timer
    // Set alarm to call onTimer function every second (value in microseconds).
    // Repeat the alarm (third parameter) with unlimited count = 0 (fourth parameter).
    timerAlarm(timer_adc, (uint64_t)20000000 / SAMPLERATE, true, 0);
    timerStart(timer_adc);

#else
    adc_continue_init();
#endif

// Initialize FIR filter
// resample_fir.coeffs = (float *)resample_coeffs;
// resample_fir.delay = filter_state;
// resample_fir.N = FILTER_TAPS;
// resample_fir.pos = 0;

// pinMode(MIC_PIN, INPUT);
//  Init ADC and Characteristics
//  esp_adc_cal_characteristics_t characteristics;
//  adc1_config_width(ADC_WIDTH_BIT_12);
//  adc1_config_channel_atten(SPK_PIN, cfg_adc_atten); // Input 1.24Vp-p,Use R 33K-(10K//10K) divider input power 1.2Vref
//  esp_adc_cal_characterize(ADC_UNIT_1, cfg_adc_atten, ADC_WIDTH_BIT_12, 0, &adc1_chars);

// adc1_config_channel_atten(SPK_PIN, ADC_ATTEN_DB_12); //Input 3.3Vp-p,Use R 10K divider input power 3.3V
// esp_adc_cal_get_characteristics(V_REF, ADC_ATTEN_DB_12, ADC_WIDTH_BIT_12, &characteristics);
// ESP_LOGD(TAG_AFSK, "v_ref routed to 3.3V\n");
#endif

    sigmadelta_init();
    ESP_LOGD(TAG_AFSK, "Sigma Delta Initialized");
    // Create semaphore to inform us when the timer has fired
    // timerSemaphore = xSemaphoreCreateBinary();
    // Set timer frequency to 20Mhz
    timer_dac = timerBegin(20000000);
    // Attach onTimer function to our timer.
    timerAttachInterrupt(timer_dac, &sample_dac_isr); // Attaches the handler function to the timer
    // Set alarm to call onTimer function every second (value in microseconds).
    // Repeat the alarm (third parameter) with unlimited count = 0 (fourth parameter).
    timerAlarm(timer_dac, (uint64_t)20000000 / CONFIG_AFSK_DAC_SAMPLERATE, true, 0);
    timerStop(timer_dac);

