hiperiondev/esp32idf_APRS/components/esp32_IDF_libAPRS/AFSK.c
    //   ESP_LOGI(TAG, "Create timer handle");
    //   gptimer_handle_t gptimer = NULL;
    //   gptimer_config_t timer_config = {
    //       .clk_src = GPTIMER_CLK_SRC_DEFAULT,
    //       .direction = GPTIMER_COUNT_UP,
    //       .resolution_hz = 8000000, // 1MHz, 1 tick=1us
    //   };
    //   ESP_ERROR_CHECK(gptimer_new_timer(&timer_config, &gptimer));

    //   gptimer_event_callbacks_t cbs = {
    //       .on_alarm = example_timer_on_alarm_cb,
    //   };
    //   ESP_ERROR_CHECK(gptimer_register_event_callbacks(gptimer, &cbs, queue));

    //   ESP_LOGI(TAG, "Enable timer");
    //   ESP_ERROR_CHECK(gptimer_enable(gptimer));

    //   ESP_LOGI(TAG, "Start timer, stop it at alarm event");
    //   gptimer_alarm_config_t alarm_config1 = {
    //       .alarm_count = (uint64_t)8000000/ SAMPLERATE, // period = 1s
    //   };
    //   alarm_config1.flags.auto_reload_on_alarm = true;
    //   alarm_config1.reload_count = 0;
    //   ESP_ERROR_CHECK(gptimer_set_alarm_action(gptimer, &alarm_config1));
    //   ESP_ERROR_CHECK(gptimer_start(gptimer));
    // if (xQueueReceive(queue, &ele, pdMS_TO_TICKS(2000))) {
    //     ESP_LOGI(TAG, "Timer stopped, count=%llu", ele.event_count);
    // } else {
    //     ESP_LOGW(TAG, "Missed one count event");
    // }

    setTransmit(false);
    ESP_LOGD(TAG_AFSK, "AFSK Hardware Initialized");
}

void AFSK_init(int8_t adc_pin, int8_t dac_pin, int8_t ptt_pin, int8_t sql_pin, int8_t pwr_pin, int8_t led_tx_pin, int8_t led_rx_pin, int8_t led_strip_pin,
               bool ptt_act, bool sql_act, bool pwr_act) {
    _adc_pin = adc_pin;
    _dac_pin = dac_pin;
    _ptt_pin = ptt_pin;
    _sql_pin = sql_pin;
    _pwr_pin = pwr_pin;
    _led_tx_pin = led_tx_pin;
    _led_rx_pin = led_rx_pin;
    _led_strip_pin = led_strip_pin;

    _ptt_active = ptt_act;
    _sql_active = sql_act;
    _pwr_active = pwr_act;

    if (xI2CSemaphore == NULL) {
        xI2CSemaphore = xSemaphoreCreateMutex();
        if ((xI2CSemaphore) != NULL)
            xSemaphoreGive((xI2CSemaphore));
    }

    tcb_t *tp = &tcb;
    int i = 0;
    tp->port = i;
    tp->kiss_type = i << 4;
    tp->avg = 2048;
    tp->cdt = false;
    tp->cdt_lvl = 0;
    tp->cdt_led_pin = 2;
    tp->cdt_led_on = 2;
    ESP_LOGD(TAG_AFSK, "cdt_led_pin = %d, cdt_led_on = %d, port = %d", tp->cdt_led_pin, tp->cdt_led_on, tp->port);
// tp->ptt_pin = 12;
#ifdef FX25TNCR2
    tp->sta_led_pin = STA_LED_PIN[i];
#endif

#ifdef FX25_ENABLE
    tp->fx25_parity = FX25_PARITY[i]; // FX.25 parity
#endif
    tp->cdt_sem = xSemaphoreCreateBinary();
    assert(tp->cdt_sem);
    assert(xSemaphoreGive(tp->cdt_sem) == pdTRUE); // initialize

    // KISS default parameter
    // tp->fullDuplex = kiss_fullduplex[i]; // half duplex
    tp->fullDuplex = true;  // full duplex
    tp->SlotTime = 10;      // 100ms
    tp->TXDELAY = 50;       // 500ms
    tp->persistence_P = 63; // P = 0.25
    AFSK_hw_init();
}

// ADC memory cleanup function to prevent heap leaks
void AFSK_deinit() {
    ESP_LOGD(TAG_AFSK, "AFSK deinitialization - cleaning up ADC resources");

    // Stop ADC if running
    if (AdcHandle != NULL) {
        adc_continuous_stop(AdcHandle);
        ESP_LOGD(TAG_AFSK, "ADC continuous stopped");
    }

    // Free audio buffer memory
    if (audio_buffer != NULL) {
        free(audio_buffer);
        audio_buffer = NULL;
        ESP_LOGD(TAG_AFSK, "Audio buffer freed");
    }

    // Delete ADC calibration handle to free calibration memory
    if (AdcCaliHandle != NULL) {
#if defined(CONFIG_IDF_TARGET_ESP32)
        adc_cali_delete_scheme_line_fitting(AdcCaliHandle);
        ESP_LOGD(TAG_AFSK, "ADC calibration handle (line fitting) deleted");
#else
        adc_cali_delete_scheme_curve_fitting(AdcCaliHandle);
        ESP_LOGD(TAG_AFSK, "ADC calibration handle (curve fitting) deleted");
#endif
        AdcCaliHandle = NULL;
    }

    // Delete ADC continuous handle to free ADC memory
    if (AdcHandle != NULL) {
        adc_continuous_deinit(AdcHandle);
        ESP_LOGD(TAG_AFSK, "ADC continuous handle deleted");
        AdcHandle = NULL;
    }

    ESP_LOGD(TAG_AFSK, "AFSK deinitialization completed - ADC memory freed");
}

int offset = 0;
int dc_offset = 620;
// void afskSetDCOffset(int val)
// {
//   dc_offset = offset = val;
// }

// bool dac_push(uint8_t data)
// {
//   if (dacq.isFull())
//   {
//     delay(5);
//   }
//   dacq.push(&data);
//   return true;
// }

bool sqlActive = false;

// #ifndef I2S_INTERNAL
//  int x=0;

uint8_t sinwave = 127;

bool adcq_lock = false;

uint16_t phaseAcc = 0;

void IRAM_ATTR sample_dac_isr() {
    if (hw_afsk_dac_isr) {
        portENTER_CRITICAL_ISR(&timerMux); // ISR start
        sinwave = MODEM_BAUDRATE_TIMER_HANDLER();
        // Sigma-delta duty of one channel, the value ranges from -128 to 127, recommended range is -90 ~ 90.The waveform is more like a random one in this
        // range.
        int8_t sine = (int8_t)(((sinwave - 127) * 12) >> 4); // Redue sine = -85 ~ 85
        sdm_channel_set_pulse_density(sdm_chan, sine);
        portEXIT_CRITICAL_ISR(&timerMux); // ISR end
                                          // Give a semaphore that we can check in the loop
                                          // xSemaphoreGiveFromISR(timerSemaphore, NULL);
    }
}

extern int mVrms;
extern float dBV;

long mVsum = 0;
int mVsumCount = 0;
uint8_t dcd_cnt = 0;
bool sqlActiveOld = false;
#define READ_LEN 256
// uint32_t ret_num = 0;
// uint8_t resultADC[READ_LEN] = {0};

void AFSK_Poll(bool SA818, bool RFPower) {
    fifoSampleCount = fifo.count; // Diagnostic snapshot
    int mV;
    int x = 0;
    int16_t adc = 0;
    // uint8_t sintable[8] = {127, 217, 254, 217, 127, 36, 0, 36};
#ifdef I2S_INTERNAL
    size_t bytesRead;
    uint16_t pcm_in[ADC_SAMPLES_COUNT];
    uint16_t pcm_out[ADC_SAMPLES_COUNT];
#endif

    if (_sql_pin > -1) {                                  // Set SQL pin active
        if ((digitalRead(_sql_pin) ^ _sql_active) == 0) { // signal active with sql_active
            sqlActive = true;
#if defined(ADC_SAMPLE)
            if (sqlActiveOld == false) {
                AFSK_TimerEnable(true); // Start ADC if SQL pin is set
            }
#endif
        } else {
            sqlActive = false;
            if (sqlActiveOld == true) {
#if defined(ADC_SAMPLE)
                AFSK_TimerEnable(false); // Stop ADC if SQL pin is not set
#endif
                LED_Status2(0, 0, 0);
            }
        }
    } else {
        sqlActive = true;
    }
    sqlActiveOld = sqlActive;

    if (hw_afsk_dac_isr) {

